import UIKit

// =================================
// MARK: - Hometask
// =================================

/*
 Для решения данных задач используйте Generics и Closures */

/*
 1. Реализуйте универсальную функцию для выполнения простых математических операций
 2. Реализуйте универсальную функцию, которая отсортирует массив по возрастанию или убыванию
 3. Реализуйте универсальную функцию, которая отсортированный массив из задачи 2 запакует в словарь,
    где порядковый номер элемента - это ключ, а значение массива перенесите в значение словаря. */


// =================================
// MARK: - Task 1
// =================================

// ...

func mathOperation<N: FloatingPoint>(_ fV: N, _ sV: N, _ opr: String) -> N {
    switch opr {
    case "-":
        return fV - sV
    case "*":
        return fV * sV
    case "/":
        return fV / sV
    default:
        return fV + sV
    }
}



// =================================
// MARK: - Task 2
// =================================

// ...

func sortBySort <T: Comparable>(_ arr: [T], _ direction: String) -> [T] {
    if (direction == "<"){
        return arr.sorted() {$0 < $1}
    }else{
        return arr.sorted() {$0 > $1}
    }
    // по хорошему и кучу обработок ошибок всунуть
}




// =================================
// MARK: - Task 3
// =================================

// ...

func toDictionary<T> (_ inArr: [T]) -> [Int: T]{
    var dict: [Int: T] = [:]
    for (key, value) in inArr.enumerated() {
        dict[key] = value
    }
    return dict
}



